<!--
  French translation 
  Translated from default version : usage.docbook.xml (v 1.3)
-->
<chapter>
  <title>Utilisation de l'Applet Jmol</title>
  <section>
    <title>Inclure l'Applet Jmol dans une Page Web</title>
    <para>
      Pour include l'Applet Jmol dans une page web, vous avez besoin d'un seul
      fichier d'archive java, <emphasis>JmolApplet.jar</emphasis>. Toutes les
      classes et les fichiers de donn&eacute;es sont inclus dans ce fichier.
      Mettez cif fichier dans le r&eacute;pertoire sur votre serveur web.
    </para>
    <para>
      Le nom de la classe de l'applet est <emphasis>JmolApplet</emphasis>.
    </para>
    <para>
      L'applet Jmol peut &ecirc;tre incluse dans des pages html en utilisant
      le tag html APPLET:
      <programlisting><![CDATA[
        <applet code="JmolApplet" archive="JmolApplet.jar"
          width="350" height="350">
          <param name="load" value="caffeine.xyz">
        </applet>
        ]]>
      </programlisting>
    </para>
    <para>
      CODE identifie le nom de la classe, dans ce cas 'JmolApplet' ou
      'JmolApplet.class'. ARCHIVE identifie le nom du fichier jar o&ugrave;
      les classes pour cette applet peuvent &ecirc;tre trouv&eacute;es.
      WIDTH and HEIGHT sp&eacute;cifient les dimensions de l'applet dans la
      page html en pixels.
    </para>
    <para>
      Les tags PARAM sont utilis&eacute;s pour passer des param&egrave;tres
      &agrave; l'applet. Le param&egrave;tre LOAD sp&eacute;cifige l'URL du
      fichier de mol&eacute;cule qui doit &ecirc;tre lu.
    </para>
    <para>
      Le code suivant est une version l&eacute;g&egrave;rement plus
      compliqu&eacute;e avec quelques options en plus:
      <programlisting><![CDATA[
        <applet name="jmol" code="JmolApplet" archive="JmolApplet.jar"
          width="350" height="350" align="right">
          <param name="load"    value="molecules/caffeine.xyz">
          <param name="bgcolor" value="#DDDDFF">
          <param name="style"   value="wireframe">
          <param name="label"   value="symbol">
          <param name="script"  value="move 0 0 360 0 0 0 0 0 5">
          <param name="wireframeRotation" value="true">
          <param name="perspectiveDepth"  value="false">
        </applet>
        ]]>
      </programlisting>
    </para>
    <para>
      Dans cet exemple un nom est donn&eacute; &agrave; l'applet de telle
      sorte qu'elle puisse &ecirc;tre r&eacute;f&eacute;renc&eacute;e depuis
      du code JavaScript (applet="jmol"). L'applet est align&eacute;e &agrave;
      droite de la page de telle sorte que le texte se d&eacute;roule &agrave;
      gauche (align="right"). En utilisant des param&egrave;tres
      suppl&eacute;mentaires (&lt;param name="*" value="*"&gt;) une
      mol&eacute;cule est charg&eacute;e depuis une URL relative sur le serveur
	  web (molecules/caffeine.xyz), la couleur de fond est positionn&eacute;e
      &agrave; bleu clair (#DDDDFF), le style est modifi&eacute; de telle sorte
      que les atomes/liens ombr&eacute;s ne sont pas utilis&eacute;
      (wireframe), les atomes sont &eacute;tiquett&eacute;s avec leur symbole
      atomique (symbol), un script qui tourne &agrave; 360 degr&eacute;s autour
      de l'axe z en 5 secondes est lanc&eacute;, wireframeRotation est
      activ&eacute; de telle sorte que tout les mouvements sont faits en mode
      fil de fer, et la profondeur de la perspective est
      d&eacute;sactiv&eacute;e de telle sorte que le rendu de la mol&eacute;le
      est une projection plate sur l'&eacute;cran sans ajustement de taille
      pour les atomes et les liens plus &eacute;loign&eacute;s du
      spectateur.
    </para>
  </section>
  <section>
    <title>Param&egrave;tres de l'Applet Jmol</title>
    <para>
      La liste compl&egrave;te des param&egrave;tres de l'Applet Jmol est la
      suivante:
      <itemizedlist>
        <listitem>
          <para>
            bgcolor - La couleur de fond: noms de couleur officiels html ou
            notation #RRVVBB.
          </para>
        </listitem>
        <listitem>
          <para>
            style - Le style de rendu pour les atomes et les liens:
            SHADED (=ombt&eacute;) ou WIREFRAME (=fil de fer)
            (QUICKDRAW n'est plus support&eacute;)
          </para>
        </listitem>
        <listitem>
          <para>
            label - Le style de rendu pour les &eacute;tiquettes des atomes:
            NONE (=aucun), SYMBOL (=symbole) ou NUMBER (=num&eacute;ro)
          </para>
        </listitem>
        <listitem>
          <para>
            wireframeRotation - Les rotations utilisent le fil de fer pour un
            rendu plus rapide:
            TRUE (=vrai) ou FALSE (=faux) (valeur par d&eacute;faut: FALSE)
          </para>
        </listitem>
        <listitem>
          <para>
            perspectiveDepth - La projection peut &ecirc;tre plate ou donner
            une impression de perspective:
            TRUE (=vrai) ou FALSE (=faux) (valeur par d&eacute;faut: TRUE)
          </para>
        </listitem>
        <listitem>
          <para>
            script - Commandes de script RasMol/Chime &agrave; ex&eacute;cuter
          </para>
        </listitem>
      </itemizedlist>
    </para>
    <section>
      <title>style</title>
      <section>
        <title>shaded</title>
        <para>
          Dessine les atomes et les liens sous la forme de sph&egrave;res et de
          cylindres ombr&eacute;s. Les images ombr&eacute;es sont
          calcul&eacute;es et mis en cache, ce qui implique que les
          performances ne devraient pas poser de probl&egrave;me sauf dans le
          cas de tr&egrave;s grosses mol&eacute;cules.
        </para>
      </section>
      <section>
        <title>wireframe</title>
        <para>
          Dessine  les atomes sous la forme de cercles non remplis. Les liens
          sont dessin&eacute;s sous la forme de lignes simples.
        </para>
        <para>
          Remarque: Si les performances de dessin sont trop lentes avec de
          tr&egrave;s grosses mol&eacute;cules, l'option WIREFRAMEROTATION
          peut &ecirc;tre utilis&eacute;e pour passer en mode fil de fer
          pendant les rotations et les translations.
        </para>
      </section>
      <section>
        <title>quickdraw - Plus support&eacute;</title>
        <para>
          Dessine les atomes et les liens sous la forme de cercles et de
          rectangles plats et unis.
        </para>
        <para>
          Le style quickdraw n'est plus support&eacute; et sera supprim&eacute;
          des futures versions de Jmol.
        </para>
      </section>
    </section>
    <section>
      <title>Atom Labels</title>
      <section>
        <title>none</title>
        <para>
          Affiche les atomes sans &eacute;tiquette. C'est la valeur par
          d&eacute;faut.
        </para>
      </section>
      <section>
        <title>symbol</title>
        <para>
          Etiquette les atomes avec leur symbole atomique.
        </para>
      </section>
      <section>
        <title>number</title>
        <para>
          Etiquette les atomes avec leur index.
        </para>
      </section>
    </section>
    <section>
      <title>script</title>
      <para>
        Le param&egrave;tre script vous permet de pr&eacute;ciser un script de
        commandes RasMol/Chime &agrave; ex&eacute;ter apr&egrave;s que le
        fichier de la mol&eacute;cule ait &eacute;t&eacute; charg&eacute;.
      </para>
      <para>
        Des commandes de script multiples doivent &ecirc;tre
        s&eacute;par&eacute;es par des caract&egrave;res point virgule (;).
      </para>
    </section>
  </section>
</chapter>
